In [2]:
import pandas as pd

In [8]:
s = pd.Series(['A', 'B'])

In [6]:
s

0    A
1    B
dtype: object

In [11]:
salary = {'John': 3000, 'Tim': 4500}

In [12]:
salary

{'John': 3000, 'Tim': 4500}

In [13]:
se3 = pd.Series(salary)
se3

John    3000
Tim     4500
dtype: int64

In [14]:
se3['Tim']

4500

In [15]:
data = {'Name': ['John', 'Tim', 'Rob'], 'Age': [34, 23, 42], 'Salary': [2000, 3000, 5000]}

In [16]:
data

{'Name': ['John', 'Tim', 'Rob'],
 'Age': [34, 23, 42],
 'Salary': [2000, 3000, 5000]}

In [17]:
print(data)

{'Name': ['John', 'Tim', 'Rob'], 'Age': [34, 23, 42], 'Salary': [2000, 3000, 5000]}

In [18]:
frame = pd.DataFrame(data)

In [19]:
frame

   Name  Age  Salary
0  John   34    2000
1   Tim   23    3000
2   Rob   42    5000

In [21]:
new_frame = pd.DataFrame(data, columns=['Name', 'Age', 'Salary'])
new_frame

   Name  Age  Salary
0  John   34    2000
1   Tim   23    3000
2   Rob   42    5000

In [22]:
new_frame['Salary']

0    2000
1    3000
2    5000
Name: Salary, dtype: int64

In [30]:
new_frame.iloc[2]

Name       Rob
Age         42
Salary    5000
Name: 2, dtype: object

In [32]:
new_frame['Profile'] = ['Doctor', 'Coder', 'Designer']
new_frame

   Name  Age  Salary   Profile
0  John   34    2000    Doctor
1   Tim   23    3000     Coder
2   Rob   42    5000  Designer

In [33]:
new_frame = new_frame.T
new_frame

              0      1         2
Name       John    Tim       Rob
Age          34     23        42
Salary     2000   3000      5000
Profile  Doctor  Coder  Designer

In [36]:
new_frame = new_frame.T
new_frame

   Name Age Salary   Profile
0  John  34   2000    Doctor
1   Tim  23   3000     Coder
2   Rob  42   5000  Designer

In [41]:
obj = pd.Series([100,200,300], index=['a', 'b', 'c'])
obj

a    100
b    200
c    300
dtype: int64

In [50]:
obj.reindex(['b', 'c', 'a', 'd'], fill_value=1)
obj

a    100
b    200
c    300
dtype: int64

In [51]:
index = ['Firefox', 'Chrome', 'Safari', 'IE10', 'Konqueror']
df = pd.DataFrame({'http_status': [200, 200, 404, 404, 301],
                  'response_time': [0.04, 0.02, 0.07, 0.08, 1.0]},
                  index=index)
df

           http_status  response_time
Firefox            200           0.04
Chrome             200           0.02
Safari             404           0.07
IE10               404           0.08
Konqueror          301           1.00

In [53]:
new_index = ['Safari', 'Iceweasel', 'Comodo Dragon', 'IE10',
             'Chrome']
df.reindex(new_index, fill_value=0)

               http_status  response_time
Safari                 404           0.07
Iceweasel                0           0.00
Comodo Dragon            0           0.00
IE10                   404           0.08
Chrome                 200           0.02

In [58]:
frame2 = new_frame.drop([2])
frame2

   Name Age Salary Profile
0  John  34   2000  Doctor
1   Tim  23   3000   Coder